package lab5.task5;

/**
 * Реализуйте метод, содержащий код, где применяются классы Scanner и PrintWriter (см. раздел 5.1.5).
 * Но вместо оператора try с ресурсами воспользуйтесь оператором catch.
 * Непременно закройте оба объекта, при условии, что они построены надлежащим образом.
 *
 * Для этого вам придется принять во внимание следующие условия.
 * • Конструктор класса Scanner генерирует исключение.
 * • Конструктор класса PrintWriter генерирует исключение.
 * • Метод h a sN e x t (), n e x t () или p r i n t l n () генерирует исключение.
 * • Метод o u t . c lo s e () генерирует исключение.
 * • Метод i n . c lo s e () генерирует исключение.
 */
public class Main {
    public static void main(String[] args) {

    }
}
